const SooratAadiaat = [
  {
    questionNo: 1,
    question: "وَ الۡعٰدِیٰتِ ضَبۡحًا کا ترجمہ ۔۔۔۔ ہے",
    options: ["پھر صبح سویرے دھاوا بولتے ہیں", " پھر انبوہ (لشکر) میں گھس جاتے ہیں،", " قسم ہے ان (گھوڑوں) کی جو ہانپتے ہوئے دوڑتے ہیں", " پھر اس سے غبار اڑاتے ہیں،"],
    correctAnswer: " قسم ہے ان (گھوڑوں) کی جو ہانپتے ہوئے دوڑتے ہیں",
  },
  {
    questionNo: 2,
    question: "فَالۡمُوۡرِیٰتِ قَدۡحًا کا ترجمہ ۔۔۔ ہے",
    options: ["پھر صبح سویرے دھاوا بولتے ہیں،", " پھر انبوہ (لشکر) میں گھس جاتے ہیں،", "پھر (اپنی) ٹھوکروں سے چنگاریاں اڑاتے ہیں", "پھر اس سے غبار اڑاتے ہیں،"],
    correctAnswer: "پھر (اپنی) ٹھوکروں سے چنگاریاں اڑاتے ہیں",
  },
  {
    questionNo: 3,
    question: "فَالۡمُغِیۡرٰتِ صُبۡحًا ۙ",
    options: [" پھر (اپنی) ٹھوکروں سے چنگاریاں اڑاتے ہیں،", " پھر انبوہ (لشکر) میں گھس جاتے ہیں", " پھر اس سے غبار اڑاتے ہیں،", " پھر صبح سویرے دھاوا بولتے ہیں"],
    correctAnswer: " پھر صبح سویرے دھاوا بولتے ہیں",
  },
  {
    questionNo: 4,
    question: "فَاَثَرۡنَ بِہٖ نَقۡعًا ۙ کا ترجمہ ۔۔۔ ہے",
    options: ["پھر (اپنی) ٹھوکروں سے چنگاریاں اڑاتے ہیں،", "پھر صبح سویرے دھاوا بولتے ہیں،", " پھر اس سے غبار اڑاتے ہیں،", " پھر انبوہ (لشکر) میں گھس جاتے ہیں،"],
    correctAnswer: " پھر اس سے غبار اڑاتے ہیں،",
  },
  {
    questionNo: 5,
    question: "فَوَسَطۡنَ بِہٖ جَمۡعًا کا ترجمہ ۔۔۔ ہے",
    options: ["پھر انبوہ (لشکر) میں گھس جاتے ہیں،", "پھر (اپنی) ٹھوکروں سے چنگاریاں اڑاتے ہیں،", " پھر صبح سویرے دھاوا بولتے ہیں،", " پھر اس سے غبار اڑاتے ہیں،"],
    correctAnswer: "پھر انبوہ (لشکر) میں گھس جاتے ہیں،",
  },
];
