const SooratZalzila = [
  {
    questionNo: 1,
    question: "اِذَا زُلۡزِلَتِ الۡاَرۡضُ زِلۡزَالَہَا کا صحیح ترجمہ کیا ہے؟",
    options: [
      "اور زمین اپنا بوجھ نکال دے گی",
      "اور انسان کہے گا کہ اسے کیا ہو گیا ہے؟",
      " جب زمین اپنی لرزش سے ہلائی جائے گی",
      "اس دن وہ اپنے حالات بیان کرے گی",
    ],
    correctAnswer: " جب زمین اپنی لرزش سے ہلائی جائے گی",
  },{
    questionNo: 2,
    question: "وَ اَخۡرَجَتِ الۡاَرۡضُ اَثۡقَالَہَا کا صحیح ترجمہ کیا ہے؟",
    options: [
      "اور زمین اپنا بوجھ نکال دے گی",
      "اور انسان کہے گا کہ اسے کیا ہو گیا ہے؟",
      " جب زمین اپنی لرزش سے ہلائی جائے گی",
      "اس دن وہ اپنے حالات بیان کرے گی",
    ],
    correctAnswer: "اور زمین اپنا بوجھ نکال دے گی",
  },{
    questionNo: 3,
    question: "وَ قَالَ الۡاِنۡسَانُ مَا لَہَا کا صحیح ترجمہ کیا ہے؟",
    options: [
      "اور زمین اپنا بوجھ نکال دے گی",
      "اور انسان کہے گا کہ اسے کیا ہو گیا ہے؟",
      " جب زمین اپنی لرزش سے ہلائی جائے گی",
      "اس دن وہ اپنے حالات بیان کرے گی",
    ],
    correctAnswer: "اور انسان کہے گا کہ اسے کیا ہو گیا ہے؟",
  },{
    questionNo: 4,
    question: "یَوۡمَئِذٍ تُحَدِّثُ اَخۡبَارَہَا کا صحیح ترجمہ کیا ہے؟",
    options: [
      "اور زمین اپنا بوجھ نکال دے گی",
      "اور انسان کہے گا کہ اسے کیا ہو گیا ہے؟",
      " جب زمین اپنی لرزش سے ہلائی جائے گی",
      "اس دن وہ اپنے حالات بیان کرے گی",
    ],
    correctAnswer: "اس دن وہ اپنے حالات بیان کرے گی",
  },{
    questionNo: 5,
    question: "رَبَّکَ اَوۡحٰی لَہَا کا صحیح ترجمہ کیا ہے؟",
    options: [
      " کیونکہ آپ کے رب نے اسے ایسا کرنے کا حکم دیا تھا",
      " آپ کے رب نے اسے ایسا کرنے کا حکم دیا تھا",
      " جب زمین اپنی لرزش سے ہلائی جائے گی",
      "اس دن وہ اپنے حالات بیان کرے گی",
    ],
    correctAnswer: " آپ کے رب نے اسے ایسا کرنے کا حکم دیا تھا",
  },{
    questionNo: 6,
    question: "یَّصۡدُرُ النَّاسُ اَشۡتَاتًا کا صحیح ترجمہ کیا ہے؟",
    options: [
      "اس دن لوگ گروہ گروہ ہو کر نکل آئیں گے",
      "لوگ گروہ گروہ ہو کر نکل آئیں گے",
      " جب زمین اپنی لرزش سے ہلائی جائے گی",
      "اس دن وہ اپنے حالات بیان کرے گی",
    ],
    correctAnswer: "لوگ گروہ گروہ ہو کر نکل آئیں گے",
  },{
    questionNo: 7,
    question: "مِثْقَالَ ذَرَّةٍ خَیْرًا کا صحیح ترجمہ کیا ہے؟",
    options: [
      "ذرہ برابر برائ",
      "ذرہ برابر نیکی",
      " جب زمین اپنی لرزش سے ہلائی جائے گی",
      "اس دن وہ اپنے حالات بیان کرے گی",
    ],
    correctAnswer: "ذرہ برابر نیکی",
  },{
    questionNo: 8,
    question: "مِثْقَالَ ذَرَّةٍ شَرًّا کا صحیح ترجمہ کیا ہے؟",
    options: [
        "ذرہ برابر برائ",
        "ذرہ برابر نیکی",
      " جب زمین اپنی لرزش سے ہلائی جائے گی",
      "اس دن وہ اپنے حالات بیان کرے گی",
    ],
    correctAnswer: "ذرہ برابر برائ",
  },{
    questionNo: 8,
    question: "لَا تَرۡفَعُوۡۤا اَصۡوَاتَکُمۡ فَوۡقَ صَوۡتِ النَّبِیِّ کا صحیح ترجمہ کیا ہے؟",
    options: [
        "نبی کے ساتھ اونچی آواز سے بات نہ کرو",
        " اپنی آوازیں نبی کی آواز سے بلند نہ کرو ",
      "اونچی آواز میں بات کرتے ہو",
      " تمہیں خبر بھی نہ ہو۔",
    ],
    correctAnswer: " اپنی آوازیں نبی کی آواز سے بلند نہ کرو ",
  },
];

export default SooratZalzila;
