const SooratQariya = [
  {
    questionNo: 1,
    question: "سورۃ القارعۃ...سورت ہے ",
    options: ["مکی", "مدنی", "متعدد روایات ہیں"],
    correctAnswer: "مکی",
  },{
    questionNo: 2,
    question: " قرآن سب سے زیادہ۔۔۔۔موضوع پر زور دیتا ہے",
    options: ["نماز", "شرک", "حیات آخرت", "کفر"],
    correctAnswer: "حیات آخرت",
  },{
    questionNo: 3,
    question: "قبروں سے نکلنے کے بعد لوگوں کی حالت کیا ہوگی",
    options: ["وہاں کوئی پناہ گاہ نہ ہو گی", "وہاں کوئی منزل نہ ہو گی", " پروانوں کی طرح پھیل جائیں گے", "تمام آپشن"],
    correctAnswer: "تمام آپشن",
  },{
    questionNo: 4,
    question: "میزان عمل میں سب سے وزنی عمل کون سا ہے؟",
    options: ["نماز پرھنا", "خمس دینا", "درود پڑھنا", "زکوۃ دینا"],
    correctAnswer: "درود پڑھنا",
  },{
    questionNo: 5,
    question: "کس کے عمل کے وزن کا پلا ہلکا ہو گا؟",
    options: ["جس نے کوئی نیکی کی ہی نہیں", "جس نے اپنی نیکی برباد کی", "جس کی نیکی ناقابل قبول رہی", "تمام آپشن"],
    correctAnswer: "تمام آپشن",
  },{
    questionNo: 6,
    question: "جہنم کو ہَاوِیَۃٌ اس لیے کہا گیا کیونکہ",
    options: ["لوگ اسمیں گر جائیں گے", "سخت ترین آگ ہے", "اس میں لوگ ہمیشہ رہیں گے", "الف اور ب"],
    correctAnswer: "لوگ اسمیں گر جائیں گے",
  }
];

export default SooratQariya;
