const SooratTakasur = [
  {
    questionNo: 1,
    question: "کَلَّا سَوۡفَ تَعۡلَمُوۡنَ سے مراد ... ہے",
    options: ["عنقریب جان لو گے", "عذاب قبر", "ہر گز نہیں", "الف اور ب"],
    correctAnswer: "عذاب قبر",
  },{
    questionNo: 2,
    question: "ثُمَّ کَلَّا سَوۡفَ تَعۡلَمُوۡنَ سے مراد ۔۔۔ہے",
    options: ["تم جان لو گے", "پھر ہر گز نہیں", "قیامت ", "عنقریب جان لو گے"],
    correctAnswer: "قیامت ",
  },{
    questionNo: 3,
    question: " عِلۡمَ الۡیَقِیۡنِ اس علم کس کو کہتے ہیں",
    options: ["مکمل علم", "شک کے بعد جو علم حاصل ہو", "جو علم ہمیں خود لیں", "الف اور ب"],
    correctAnswer: "شک کے بعد جو ؑعلم حاصل ہو",
  },{
    questionNo: 4,
    question: "یقین کے ۔۔۔ مراتب ہیں",
    options: ["علم الیقین", " عین الیقین", "حق الیقین", "تمام آپشن"],
    correctAnswer: "تمام آپشن",
  },{
    questionNo: 5,
    question: " شیعہ امامیہ نعمت سے مراد ۔۔۔ ہے",
    options: ["کجھور", "ٹھندا پانی", "محمدؐ و آل محمد علیہم السلام کی محبت", "محبت علی"],
    correctAnswer: "محمدؐ و آل محمد علیہم السلام کی محبت",
  },
];

export default SooratTakasur;
