// SooratIKausar.js
const questions = [
    {
      question: 'سورت الکوثر کی کتنی آیات ہیں؟',
      options: ['1', '2', '3', '4'],
      correctAnswer: '3',
    },
    {
      question: 'سورہ الکوثر کون سی سورت ہے؟',
      options: ['مکی', 'مدنی', 'دونوں', 'کوئ بھی نہیں'],
      correctAnswer: 'مکی',
    },{
      question: 'سورت الکوثر قرآن کی کتنے نمبر سورت ہے؟',
      options: ['107', '106', '108', '110'],
      correctAnswer: '108',
    },{
      question: 'سورت الکوثر میں کس نبی کا ذکر ہے؟',
      options: ['حضرت محمد ﷺ', 'حضرت نوح علیہ السلام', 'حضرت آدم علیہ السلام', 'حضرت ہود علیہ السلام'],
      correctAnswer: 'حضرت محمد ﷺ',
    },{
      question: 'سورت الکوثر میں حضرت محمد ﷺ کے کتنے بیٹوں کا ذکر ہے؟',
      options: ['1', '2', '3', '4'],
      correctAnswer: '2',
    },{
      question: "سورت الکوثر میں کون سی عبادت کا ذکر ہے؟",
      options: ["روزہ", "حج", " نماز", "صدقہ"],
      correctAnswer: " نماز",
    }
    ,{
      question: "سورت الکوثر کب نازل ہوئ؟",
      options: ["مکہ کی ابتدائ زندگی میں", "ہجرت کے وقت", " مدینہ میں", "آخری حج کے موقع پر"],
      correctAnswer: "مکہ کی ابتدائ زندگی میں",
    },{
      question: "سورت الکوثر میں رسول ﷺ کیلیے کیا خاص بات ہے؟",
      options:["رسالت کی تکمیل کی ضمانت", "تا قیامت باقی رہنے کی ضمانت", "نبی ہونے کی بشارت", "الف اور ب دونوں"],
      correctAnswer: "الف اور ب دونوں"
    },{
      question: "الکوثر کا مصداق کون ہے؟",
      options:["رسول ﷺ", "سیدہ فاطمہ سلام اللہ علیہ", "اولاد فاطمہ", "حضرت علی علیہ السلام"],
      correctAnswer: "سیدہ فاطمہ سلام اللہ علیہ"
    },{
      question: "سورت الکوثر کن لوگوں کی رد میں نازل ہوئ؟",
      options:["جو رسول ﷺ کو نبی مانتے تھے", "جو محمد ﷺ کو ابتر کہتے تھے", "جو محمد ﷺ کے ساتھی تھے", "جو کافر تھے"],
      correctAnswer: "جو محمد ﷺ کو ابتر کہتے تھے"
    },{
      question: "کفار قریش نے کس موقع پر خوشیاں منائ؟",
      options:["حضرت قاسم علیہ کے انتقال پر", "حضرت عبداللہ کے انتقال ہر", "حضرت ابراہیم لے انتقال ہر", "الف اور ب دونوں"],
      correctAnswer: "حضرت عبداللہ کے انتقال ہر"
    },{
      question: "آج محمد لاولد ہو گئے یہ خبر کس نے مشرکین تک پہنچائ",
      options:["ابو جہل", "ابو لہب", "ابو سفیان", "ایسا کسی نے نہیں کیا"],
      correctAnswer: "ابو لہب"
    },{
      question: "ابن عباس کی ایک روایت کے مطابق جب آپ کی نرینہ اولاد دنیا سے چلی گئی تو کس کس نے خوشیاں منائیں؟",
      options:["ابو جہل", "عقبہ بن ابی معیط", "عاص بن وائل", "تینوں نے"],
      correctAnswer: "تینوں نے"
    },{
      question: "عربی زبان میں جو چیز تعداد یا مقدار میں کثیر ہو اسے کیا کیتے ہیں؟",
      options:["کوثر", "کثیر", "زیادہ", "کم"],
      correctAnswer: "کوثر"
    },{
      question: " ایک بوڑھی عورت  جس کا بیٹا سفر سے واپس آیا تھا، پوچھا: آپ کا بیٹا کیا لے کر آیا ہے اس عورت کہا",
      options:["زاد سفر", "غنیمت", " آب بکوثر", "دولت"],
      correctAnswer: " آب بکوثر"
    },{
      question: "کوثر کے معنی کیا ہیں؟",
      options:["نماز", "دنیا کا زیادہ مال", "خیر کثیر", "شر ہی شر"],
      correctAnswer: "خیر کثیر"
    },{
      question: "خیر کثیر کے مصداق کا تعین کس آیت سے کیا جا سکتا ہے؟",
      options:["اِنَّاۤ اَعۡطَیۡنٰکَ الۡکَوۡثَرَ ؕ", " اِنَّ شَانِئَکَ ہُوَ الۡاَبۡتَرُ", "فَصَلِّ لِرَبِّکَ وَ انۡحَرۡ", "کسی سے بھی نہیں"],
      correctAnswer: " اِنَّ شَانِئَکَ ہُوَ الۡاَبۡتَرُ"
    },{
      question: " حضرت محمد کے بیٹے کی وفات سے جب غموں کا پہاڑ ٹوٹ پڑا تھا۔ اس موقع پر بنی ہاشم کے علاوہ عزیزوں، رشتہ داروں، قبیلے اور برادری کے لوگوں اور ہمسایوں نے کیا کیا؟" ,
      options:["دفن کیا", "تجہیز و تکفین کی", "ہمدردی و تعزیت", "خوشیاں منائیں"],
      correctAnswer: "خوشیاں منائیں"
    },{
      question: "فخر الدین رازی کے مطابق الۡکَوۡثَرَ سے مراد  کیا ہے؟",
      options:["دنیا کا زیادہ مال", " جو ہمیشہ باقی رہے آپؐ کی اولاد", "نماز", "خیر"],
      correctAnswer: " جو ہمیشہ باقی رہے آپؐ کی اولاد"
    },{
      question: "حضرت محمد ﷺ کی نسل کس سے چلی؟",
      options:["حضرت ابراہیم", "حضرت فاطمہ", "حضرت قاسم", "حضرت عبداللہ"],
      correctAnswer: "حضرت فاطمہ"
    },{
      question: "اِنَّاۤ اَعۡطَیۡنٰکَ الۡکَوۡثَرَ اور کثیر تعداد سے مراد ذریت ہے اور وہ",
      options:["اولاد قاسم ہے", "اولاد امیہ ہے", "اولاد فاطمہ ہے", "اولاد عبداللہ ہے"],
      correctAnswer: "اولاد فاطمہ ہے"
    },{
      question: "اِنَّاۤ اَعۡطَیۡنٰکَ الۡکَوۡثَرَ: اس آیت میں کون سا لفظ عظمت پر دلالت کرتا ہے",
      options:[" اَعۡطَیۡنٰکَ", "الۡکَوۡثَرَ", "اِنَّاۤ ", "الف اور ب"],
      correctAnswer: "اِنَّاۤ "
    },{
      question: " اَعۡطَیۡنٰکَ: لفظ عطا کس موقع پر استعمال ہوتا ہے",
      options:["جہاں عطا شدہ چیز کو مالک بنانا ہو", "جہاں کچھ عطا کرنا ہو", "کہاں عزت عطا کرنی ہو", "جہاں دولت عطا کرنی ہو"],
      correctAnswer: "جہاں عطا شدہ چیز کو مالک بنانا ہو"
    },{
      question: "اللہ تعالیٰ اپنے نبی کو جب کوئی نعمت یا کوئی عظیم کامیابی عنایت فرماتا ہے تو کس چیز کا حکم دیتا ہے",
      options:["روزے کا", "سجدے کا", "حج کا", "ادائے شکر کا"],
      correctAnswer: "ادائے شکر کا"
    },{
      question: " وَانْحَرْ: سے مراد ائمہ اہل البیت علیہم السلام سے وارد روایات کے مطابق کیا ہے؟",
      options:["نہریں", "نماز میں نحر (حلق) تک رفع یدین کرنا", "نماز", "قربانی"],
      correctAnswer: "نماز میں نحر (حلق) تک رفع یدین کرنا"
    },{
      question: "حدیث نبوی کے مطابق ہر چیز کی زینرت ہے اور نماز کی زینت ہے",
      options:["سجدہ", "ہر تکبیر کے ساتھ رفع یدین", "رکوع", "تشھد"],
      correctAnswer: "ہر تکبیر کے ساتھ رفع یدین"
    },{
      question: "اِنَّ شَانِئَکَ ہُوَ الۡاَبۡتَرُ کا صحیح ترجمہ کیا ہے؟",
      options:["لہٰذا آپ اپنے رب کے لیے نماز پڑھیں اور قربانی دیں", "بیشک ہم نے ہی آپ کو کوثر عطا فرمایا", "یقینا آپ کا دشمن ہی بے اولاد رہے گا", "حضرت محمد ﷺ"],
      correctAnswer: "یقینا آپ کا دشمن ہی بے اولاد رہے گا"
    },{
      question: "حضرت محمد ﷺ کو ابتر کہنے والوں کا نام آج کن الفاظ میں موجود ہے",
      options:["اچھے الفاظ میں", "سنہرے الفاظ میں", "خوبصورت انداز میں", "ذلت و لعنت کے ساتھ "],
      correctAnswer: "ذلت و لعنت کے ساتھ "
    },{
      question: "قرآن کریم کے معجزات میں سے ایک اہم معجزہ ہے کہ",
      options:["آج تک ہمارے ہاس ہے", "کتابی شکل میں موجود ہے", "پیش گوئی صحیح ثابت", "حاٖظ قرآن موجود ہیں"],
      correctAnswer: "پیش گوئی صحیح ثابت"
    }
  ];

  
  
  export default questions;
  