// SooratIKafiroon.js
const SooratIKafiroon = [
    {
      question: "َاحادیث رسول صلی اللہ علیہ وآلہ وسلم و ائمہ اہل بیت علیہم السلام میں اس بات کی تاکید کی گئی ہے کہ اس سورۃ کو سوتے وقت پڑھا جائے چونکہ اس میں۔۔۔۔۔ہے",
      options: ["شفا","کافروں کو جہنم کی بشارت" , "شرک سے برائت", "رزق"],
      correctAnswer: "شرک سے برائت",
    },
    {
        question: "قریش کے لوگوں نے رسول اللہ صلی اللہ علیہ وآلہ وسلم کے سامنے ایک تجویز رکھ دی کہ ۔۔۔۔۔۔۔",
        options: ["ایک سال آپ ہمارے معبودوں لات و عزی کی عبادت کریں", "ایک سال ہم آپ کے معبود کی عبادت کریں گے", 'اللہ تعالیٰ قدیم اور واجب الوجود ہے', 'الف اور ب دونوں'],
        correctAnswer: 'الف اور ب دونوں',
      },{
        question: "قُلۡ یٰۤاَیُّہَا الۡکٰفِرُوۡنَ میں قُلۡ کا خطاب اگرچہ رسول اللہ صلی اللہ علیہ وآلہ وسلم سے ہے لیکن یہ حکم ہر مسلم کے لیے ہے کہ وہ۔۔۔۔۔۔۔۔",
        options: ["کافروں کو دین کی دعوت دے", "کافروں کے دین سے برائت کا اظہار کرے", 'کافروں کو قتل کرے', 'کافروں سے تعلق قائم مہ کرے'],
        correctAnswer: "کافروں کے دین سے برائت کا اظہار کرے",
      },{
        question: "اگر کوئی آیت کسی قوم کے بارے میں نازل ہوتی ہے تو اس قوم کے ختم ہونے سے آیت کا کلی مضمون اور حکم ختم ہو جاتا تو۔۔۔۔۔۔۔",
        options: ["ٓنے والوں کے لیے قرآن کا حکم باقی نہ رہتا", "سارا قرآن مخاطبین اولین کے ساتھ خاص ہو جاتا", "قرآن ہمارے پاس موجود نہ ہوتا", 'الف اور ب دونوں'],
        correctAnswer: "'الف اور ب دونوں'",
      },
      {
        question: "مشرکین اللہ تعالیٰ کو معبود مانتے تھے، مشرکین نے اللہ کے معبود ہونے کا انکار نہیں کیا تو پھر نبی نے یہ کیسے کہہ دیا کہ میں ان معبودوں کو نہیں پوجتا جنہیں تم پوجتے ہو؟ کیونکہ ۔۔۔۔۔۔۔۔",
        options: ["دوسرے معبودوں میں اللہ کو بھی شامل کر کے اللہ کی عبادت نہیں ہوتی", "شرک کے ساتھ عبادت، اللہ کی عبادت نہیں ہے", "اللہ تعالیٰ معبودوں میں سے ایک معبود نہیں بلکہ تنہا معبود ہے", "تمام آپشن درست ہیں"],
        correctAnswer: "تمام آپشن درست ہیں",
      },
      {
        question: "جب کافروں کی طرف سے دین کے بارے میں سمجھوتے کی تجویز دی تو۔۔۔۔۔۔",
        options: [" آپ نے صلح کرلی", " آپ نے تجویز مسترد کردی", "آپ نے ان سے عہد لے لیا","آپ نے قبول فرما لی" ],
        correctAnswer: " آپ نے تجویز مسترد کردی",
      }
  ];

  
  
  export default SooratIKafiroon;
  