const SooratMahoon = [
  {
    question: "سورۃ الماعون کی ۔۔۔۔ آیات ہیں",
    options: ["4", "5", "7", "8"],
    correctAnswer: "7",
  },
  {
    question: "سورۃ الماعون کی پہلی آیت میں الدِّیۡنِ سے مراد ۔۔۔۔ ہے",
    options: ["دین خدا", "جزا و سزا", "شریعت مصطفی", "الف اور ب دونوں"],
    correctAnswer: "جزا و سزا",
  },
  {
    question: "سورۃ الماعون ۔۔۔۔ سورت ہے",
    options: ["مکی", "مدنی"],
    correctAnswer: "مکی",
  },
  {
    question: "یَدُعُّ الۡیَتِیۡمَ ۙ سے مراد ۔۔۔۔ ہے",
    options: [
      "یتیم کو دھتکار نا",
      "یتیم کی جائداد کھانا",
      "یتیم کو دھکے دینا",
      "تینوں آپشن",
    ],
    correctAnswer: "تینوں آپشن",
  },
  {
    question: "طَعَامِ الۡمِسۡکِیۡنِ سے مراد ۔۔۔ ہے",
    options: [
      "مسکین سے کھانا کھاو",
      " کھانا کھانا کھاو",
      "طعام مسکینوں کا حق ہے",
      "مسکین کا حق کھاو",
    ],
    correctAnswer: "طعام مسکینوں کا حق ہے",
  },
  {
    question: " نماز سے غافل ہونے کا مطلب ۔۔۔۔ ہے",
    options: [
      "نماز کی پرواہ نہ کرنا",
      "اول وقت میں نہ پڑھنا",
      "اجزاء و شرائط پوری نہ کرنا",
      "تمام جواب درست ہیں",
    ],
    correctAnswer: "تمام جواب درست ہیں",
  },
  {
    question: "وَ يَمْنَعُونَ الْمَاعُونَ کی تفسیر کے مطابق الْمَاعُونَ کیا ہے؟",
    options: [
      "ضرورت کی چیزوں کا تقسیم کرنا",
      "دوسروں کی مدد کرنا",
      "ریاکاری",
      "الف اور ب درست ہیں",
    ],
    correctAnswer: "الف اور ب درست ہیں",
  },
  {
    question: "نماز میں ریاکاری کرنے والے لوگوں کے بارے میں کیا کہا؟",
    options: [
      "اللہ کے لیے نماز پڑھتے",
      "نماز اللہ کے لیے نہیں ہے",
      "نماز قبول ہے",
      "الف اور ب دونوں",
    ],
    correctAnswer: "نماز اللہ کے لیے نہیں ہے",
  },{
    question: "سورت الماعون قرآن کی ۔۔۔ نمبر سورت ہے",
    options: [
      "107",
      "108",
      "109",
      "110",
    ],
    correctAnswer: "107",
  },
];

export default SooratMahoon;